# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

s = sum([1,2,3])
i = sum([1,0,0])
print("1. Сумма трех чисел (1 + 2 + 3) = ", s)
print("2. Сумма трех чисел (1 + 0 + 0) = ", i)
